# RevisionsOnSheetUIService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..RevisionsOnSheetUIService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The UI service which permits registration of an external server for new UI managing RevisionsOnSheet selection
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId RevisionsOnSheetUIService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevisionsOnSheetUIService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ RevisionsOnSheetUIService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace